test_examples/tube_OpenFoam3d_abaqus3d/Test_pointDisplacement_Parallel_Decompose_Reconstruct/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startTime 0.00001;

endTime 0.00002;

deltaT          0.00001;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions{
	wallShearStress
	{
            type        wallShearStress;
            libs ("libfieldFunctionObjects.so");

	    // Optional entries (runtime modifiable)
	    patches         ("mantle"); 

	    // Optional (inherited) entries
	    writePrecision  8;
	    writeToFile     true;
	    writeControl    timeStep;
	    writeInterval   1;
            log 	    true;

	}
}
// ************************************************************************* //
